'use strict'

// 1. Написать программу, которая будет решать квадратное уравнение вида ax^2 + bx + c = 0
// переменные a, b, c задаются в коде, нужно найти x и дать ответ в зависимости от результата:
// — “корни уравнения: х1 = %ваш ответ 1%, х2 = %ваш ответ 2%
// — “корень уравнения повторяется и равен %ваш ответ%
// — “у уравнения нет корней”


const a = prompt('Введите a');
const b = prompt('Введите b');
const c = prompt('Введите c');
const D = b ** 2 - 4 * a * c;

let x1;
let x2;

if (D > 0) {
    x1 = (-b + Math.sqrt(D)) / (2 * a);
    x2 = (-b - Math.sqrt(D)) / (2 * a);
    alert(x1, x2); 
} else if (D === 0) {
    x1 = x2 = -b / (2 * a);
    alert(`корень уравнения повторяется и равен ${x1}`);
} else {
    alert('у уравнения нет корней');
}