'use strict'

// 1. 

// Написать программу, которая будет решать квадратное уравнение вида ax^2 + bx + c = 0
// переменные a, b, c задаются в коде, нужно найти x и дать ответ в зависимости от результата:
// — “корни уравнения: х1 = %ваш ответ 1%, х2 = %ваш ответ 2%
// — “корень уравнения повторяется и равен %ваш ответ%
// — “у уравнения нет корней”

// const a = +prompt('введите a:');
// const b = +prompt('введите b:');
// const c = +prompt('введите c:');


const a = 0;
const b = -2;
const c = -3;

const D = b * b - 4 * a * c;
let x1, x2;

    if (a === 0) {
        console.log('число <a> не может быть нулем!');
    } else {
        if (D > 0) {
            x1 = (-b + Math.sqrt(D)) / (2 * a);
            x2 = (-b - Math.sqrt(D)) / (2 * a);
        } else if (D === 0) {
            x1 = -b / (2 * a);
        } else if (D < 0) {
            console.log('Уравнение не имеет действительных корней');
        }
        if (x1 === undefined) {
            console.log('корня x1 нету');
        } else {
            console.log(`Корень x1 = ${x1}`);
        }
        if (x2 === undefined) {
            console.log('корня x2 нету');
        } else {
            console.log(`Корень x2 = ${x2}`);
        }
    }
    

console.log(`Дискриминант = ${D}`);








